/* TODO: в целом так же должны передовать еще действие при клике
    но на текущий момент трудно сделать проверку на наличие например модалки
    открываемой при действии. Так что пока будем грубо делать общий обработчик
    P.S. React я скучаю =)

    TODO: Так же проблема с импортом картинок, приходиться писать путь вместо импорта
*/

const dotDropdown = [
    {icon : "../static/img/icons/add.png", name: 'Добавить пользователя'},
    {icon : "../static/img/icons/remove.png", name: 'Удалить пользователя'}
]

module.exports = dotDropdown