import cameraImg from '../static/img/camera.png';

const messages = [
  {
    chatId: 1,
    messages: [
      {
        type: 'text',
        message: 'Привет! Смотри, тут всплыл интересный кусок лунной косми' +
          'ческой истории — НАСА в какой-то момент попросила Хассельблад адап' +
          'тировать модель SWC для полетов на Луну. Сейчас мы все знаем что' +
          ' астронавты летали с моделью 500 EL — и к слову говоря, все тушки' +
          ' этих камер все еще находятся на поверхности Луны, так как астрон' +
          'авты с собой забрали только кассеты с пленкой.\n\nХассельблад в и' +
          'тоге адаптировал SWC для космоса, но что-то пошло не так и на рак' +
          'ету они так никогда и не попали. Всего их было произведено 25 шту' +
          'к, одну из них недавно продали на аукционе за 45000 евро.',
        time: '11:55',
        author: false,
      },
      {
        type: 'img',
        src: cameraImg,
        time: '11:56',
        author: false,
      },
      {
        type: 'text',
        message: 'Круто!',
        time: '12:00',
        author: true,
      },
    ],
  },
  {
    chatId: 2,
    messages: [
      {
        type: 'text',
        message: 'Привет! Смотри, тут всплыл интересный кусок лунной косми' +
          'ческой истории — НАСА в какой-то момент попросила Хассельблад адап' +
          'тировать модель SWC для полетов на Луну. Сейчас мы все знаем что' +
          ' астронавты летали с моделью 500 EL — и к слову говоря, все тушки' +
          ' этих камер все еще находятся на поверхности Луны, так как астрон' +
          'авты с собой забрали только кассеты с пленкой.\n\nХассельблад в и' +
          'тоге адаптировал SWC для космоса, но что-то пошло не так и на рак' +
          'ету они так никогда и не попали. Всего их было произведено 25 шту' +
          'к, одну из них недавно продали на аукционе за 45000 евро.',
        time: '11:55',
        author: false,
      },
      {
        type: 'img',
        src: cameraImg,
        time: '11:56',
        author: false,
      },
      {
        type: 'text',
        message: 'Круто!',
        time: '12:00',
        author: true,
      },
    ],
  },
  {
    chatId: 3,
    messages: [
      {
        type: 'text',
        message: 'Привет! Смотри, тут всплыл интересный кусок лунной косми' +
          'ческой истории — НАСА в какой-то момент попросила Хассельблад адап' +
          'тировать модель SWC для полетов на Луну. Сейчас мы все знаем что' +
          ' астронавты летали с моделью 500 EL — и к слову говоря, все тушки' +
          ' этих камер все еще находятся на поверхности Луны, так как астрон' +
          'авты с собой забрали только кассеты с пленкой.\n\nХассельблад в и' +
          'тоге адаптировал SWC для космоса, но что-то пошло не так и на рак' +
          'ету они так никогда и не попали. Всего их было произведено 25 шту' +
          'к, одну из них недавно продали на аукционе за 45000 евро.',
        time: '11:55',
        author: false,
      },
      {
        type: 'img',
        src: cameraImg,
        time: '11:56',
        author: false,
      },
      {
        type: 'text',
        message: 'Круто!',
        time: '12:00',
        author: true,
      },
    ],
  },
  {
    chatId: 4,
    messages: [
      {
        type: 'text',
        message: 'Привет! Смотри, тут всплыл интересный кусок лунной косми' +
          'ческой истории — НАСА в какой-то момент попросила Хассельблад адап' +
          'тировать модель SWC для полетов на Луну. Сейчас мы все знаем что' +
          ' астронавты летали с моделью 500 EL — и к слову говоря, все тушки' +
          ' этих камер все еще находятся на поверхности Луны, так как астрон' +
          'авты с собой забрали только кассеты с пленкой.\n\nХассельблад в и' +
          'тоге адаптировал SWC для космоса, но что-то пошло не так и на рак' +
          'ету они так никогда и не попали. Всего их было произведено 25 шту' +
          'к, одну из них недавно продали на аукционе за 45000 евро.',
        time: '11:55',
        author: false,
      },
      {
        type: 'img',
        src: cameraImg,
        time: '11:56',
        author: false,
      },
      {
        type: 'text',
        message: 'Круто!',
        time: '12:00',
        author: true,
      },
    ],
  },
  {
    chatId: 5,
    messages: [
      {
        type: 'text',
        message: 'Привет! Смотри, тут всплыл интересный кусок лунной косми' +
          'ческой истории — НАСА в какой-то момент попросила Хассельблад адап' +
          'тировать модель SWC для полетов на Луну. Сейчас мы все знаем что' +
          ' астронавты летали с моделью 500 EL — и к слову говоря, все тушки' +
          ' этих камер все еще находятся на поверхности Луны, так как астрон' +
          'авты с собой забрали только кассеты с пленкой.\n\nХассельблад в и' +
          'тоге адаптировал SWC для космоса, но что-то пошло не так и на рак' +
          'ету они так никогда и не попали. Всего их было произведено 25 шту' +
          'к, одну из них недавно продали на аукционе за 45000 евро.',
        time: '11:55',
        author: false,
      },
      {
        type: 'img',
        src: cameraImg,
        time: '11:56',
        author: false,
      },
      {
        type: 'text',
        message: 'Круто!',
        time: '12:00',
        author: true,
      },
    ],
  },
];

export default messages;
